Script started on 2020-02-06 16:22:49-05:00 [TERM="xterm-256color" TTY="/dev/pts/1" COLUMNS="80" LINES="24"]
bash: /home/umrigar/cs240/bin/student.rc: Permission denied
bklayma1@g7-15:~/i240b/submit/lab2$ ls
1-hello  2-hello  3-overload  lab2.LOG	Makefile
bklayma1@g7-15:~/i240b/submit/lab2$ cd 1-hello/
bklayma1@g7-15:~/i240b/submit/lab2/1-hello$ ls -l
total 12
-rw-r--r-- 1 bklayma1 bklayma1 363 Feb  6 16:20 hello.cc
-rw-r--r-- 1 bklayma1 bklayma1  39 Feb  6 16:20 Makefile
-rw-r--r-- 1 bklayma1 bklayma1  61 Feb  6 16:20 README
bklayma1@g7-15:~/i240b/submit/lab2/1-hello$ ./hello
bash: ./hello: No such file or directory
bklayma1@g7-15:~/i240b/submit/lab2/1-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
bklayma1@g7-15:~/i240b/submit/lab2/1-hello$ ./hello 
usage: ./hello NAME...
bklayma1@g7-15:~/i240b/submit/lab2/1-hello$ ./hello bart lisa
hello bart
hello lisa
hello bklayma1@g7-15:~/i240b/submit/lab2/1-hello$ [Kbklayma1@g7-15:~/i240b/submit/lab2/1-hello$ [Kbklayma1@g7-15:~/i240b/submit/lab2/1-hello$ [Kbklayma1@g7-15:~/i240b/submit/lab2/1-hello$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start bart lki[K[Kisa
Temporary breakpoint 1 at 0x11cd: file hello.cc, line 13.
Starting program: /import/linux/home1/bklayma1/projects/i240b/submit/lab2/1-hello/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe768) at hello.cc:13
13	  if (argc == 1) {
(gdb) l
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
(gdb) b sayHello
Breakpoint 2 at 0x555555555181: file hello.cc, line 7.
(gdb) p argc
$1 = 3
(gdb) p argv
$2 = (const char **) 0x7fffffffe768
(gdb) p argv[0]
$3 = 0x7fffffffea5c "/import/linux/home1/bklayma1/projects/i240b/submit/lab2/1-hello/hello"
(gdb) p argv[1]
$4 = 0x7fffffffeaa2 "bart"
(gdb) p argv[2]
$5 = 0x7fffffffeaa7 "lisa"
(gdb) p 8ARGV@3[K[K[K[K[K[K[K*argv@3
$6 = {
  0x7fffffffea5c "/import/linux/home1/bklayma1/projects/i240b/submit/lab2/1-hello/hello", 0x7fffffffeaa2 "bart", 0x7fffffffeaa7 "lisa"}
(gdb) n
18	    for (int i = 1; i <= argc; i++) {
(gdb) n
19	      sayHello(argv[i]);
(gdb) p i
$7 = 1
(gdb) c
Continuing.

Breakpoint 2, sayHello (name=0x7fffffffeaa2 "bart") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) l
2	#include <cstdlib>
3	
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
11	main(int argc, const char *argv[])
(gdb) backtrt[Kace
#0  sayHello (name=0x7fffffffeaa2 "bart") at hello.cc:7
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe768) at hello.cc:19
(gdb) p argc
No symbol "argc" in current context.
(gdb) up
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe768) at hello.cc:19
19	      sayHello(argv[i]);
(gdb) p argc
$8 = 3
(gdb) p argv
$9 = (const char **) 0x7fffffffe768
(gdb) p i
$10 = 1
(gdb) down
#0  sayHello (name=0x7fffffffeaa2 "bart") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) p name
$11 = 0x7fffffffeaa2 "bart"
(gdb) c
Continuing.
hello bart

Breakpoint 2, sayHello (name=0x7fffffffeaa7 "lisa") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) p name
$12 = 0x7fffffffeaa7 "lisa"
(gdb) c
Continuing.
hello lisa

Breakpoint 2, sayHello (name=0x0) at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) p name
$13 = 0x0
(gdb) up
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe768) at hello.cc:19
19	      sayHello(argv[i]);
(gdb) p i
$14 = 3
(gdb) p argc
$15 = 3
(gdb) q
A debugging session is active.

	Inferior 1 [process 1162305] will be killed.

Quit anyway? (y or n) y
bklayma1@g7-15:~/i240b/submit/lab2/1-hello$ emacs [K[K[K[K[K[Kls
hello  hello.cc  Makefile  README
bklayma1@g7-15:~/i240b/submit/lab2/1-hello$ emacs hello.cc 
bklayma1@g7-15:~/i240b/submit/lab2/1-hello$ ./hello bart lisa
hello bart
hello lisa
hello bklayma1@g7-15:~/i240b/submit/lab2/1-hello$ ./hello bart lisa[2Pemacs hello.cc 
bklayma1@g7-15:~/i240b/submit/lab2/1-hello$ emacs hello.cc ./hello bart lisa[2Pemacs hello.cc [Kmake'
> ^Zbash: unexpected EOF while looking for matching `''
bash: syntax error: unexpected end of file
bklayma1@g7-15:~/i240b/submit/lab2/1-hello$ make'[K
g++ -g -Wall -std=c++17    hello.cc   -o hello
bklayma1@g7-15:~/i240b/submit/lab2/1-hello$ ./h [Kello  [Kbart lisa
hello bart
hello lisa
bklayma1@g7-15:~/i240b/submit/lab2/1-hello$ cd ../2-hello/
bklayma1@g7-15:~/i240b/submit/lab2/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
bklayma1@g7-15:~/i240b/submit/lab2/2-hello$ ./hello B[Kv[Kbart lisa
Hello Bart
Hello Lisa
Segmentation fault
bklayma1@g7-15:~/i240b/submit/lab2/2-hello$ ./hello 'bart simpson' 'lisa simpso n'
Hello Bart Simpson–U
Hello Lisa Simpson–U
Segmentation fault
bklayma1@g7-15:~/i240b/submit/lab2/2-hello$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) 
[1]+  Stopped                 gdb hello
bklayma1@g7-15:~/i240b/submit/lab2/2-hello$ ./[K[Kmake
g++ -g -Wall -std=c++17    hello.cc   -o hello
bklayma1@g7-15:~/i240b/submit/lab2/2-hello$ ./hello b[KBart Lisa
Hello Bart
Hello Lisa
bklayma1@g7-15:~/i240b/submit/lab2/2-hello$ ./hello Bart Lisamake[Kgdb hello./hello 'bart simpson' 'lisa simpson'
Hello Bart SimpsonOV
Hello Lisa SimpsonOV
bklayma1@g7-15:~/i240b/submit/lab2/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
bklayma1@g7-15:~/i240b/submit/lab2/2-hello$ make./hello 'bart simpson' 'lisa simpson'
Hello Bart Simpson
Hello Lisa Simpson
bklayma1@g7-15:~/i240b/submit/lab2/2-hello$ cd ../3-overload/
bklayma1@g7-15:~/i240b/submit/lab2/3-overload$ make
g++ -g -Wall -std=c++17    overload.cc   -o overload
bklayma1@g7-15:~/i240b/submit/lab2/3-overload$ ./overload 
f(a) = 3; f(&a) = 4; f(a, b) = -1
bklayma1@g7-15:~/i240b/submit/lab2/3-overload$ gdb overload
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the G